pmo-dataset/graphviz/01.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Send order\nconfirmation to\ncustomer" -> "ExclusiveGateway_1";
  "ExclusiveGateway_3" -> "end";
  "ParallelGateway_2" -> "Address customer\nconcerns or\nquestions";
  "Record order in\nsystem" -> "Send order\nconfirmation to\ncustomer";
  "Address customer\nconcerns or\nquestions" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "Collect customer\ninformation" -> "ParallelGateway_1";
  "start" -> "Receive customer\ninquiry";
  "ParallelGateway_2" -> "Collect customer\ninformation";
  "ExclusiveGateway_4" -> "ExclusiveGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Place order" -> "Record order in\nsystem";
  "ExclusiveGateway_4" -> "Guide customer in\nselecting\nproduct/service";
  "Provide quote" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Place order";
  "Receive customer\ninquiry" -> "ParallelGateway_2";
  "Guide customer in\nselecting\nproduct/service" -> "Provide quote";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
